# SQLITE3

In [1]:
import sqlite3

In [2]:
db1=sqlite3.connect("D:\MySQLite3_database\scoredb.db")

In [3]:
cur=db1.cursor()

In [4]:
cur.execute("create table score(id primary key,sportname text unique, dateofevent date,country text not null)")

In [6]:
cur.execute("insert into score values(101,'Cricket',2022-05-06,'India'),(102,'tenis',2022-05-06,'China')")

In [7]:
print(cur.rowcount,"rows")

2 rows

In [8]:
cur.execute("insert into score values(103,'football',2022-05-05,'bangladesh'),(104,'basketball',2022-05-04,'Norway')")

In [14]:
print(cur.rowcount)

2

In [16]:
db1.commit()

In [20]:
sql1=("select * from score")

cur.execute(sql1)
cur.fetchall()

[(101, 'Cricket', 2011, 'India'),
 (102, 'tenis', 2011, 'China'),
 (103, 'football', 2012, 'bangladesh'),
 (104, 'basketball', 2013, 'Norway')]

# EMPLOYEE DATABASE with DB and python programmatically

In [1]:
import sqlite3

In [5]:
con=sqlite3.connect("employeedatabase.db")

In [6]:
# creating function

def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee (id integer primary key,name text, salary real,department text, position text,hiredate date)")
    con.commit()

In [7]:
# calling function to create table(con)

sql_table(con)

In [8]:
cur=con.cursor()
cur.execute("insert into employee values( 1,'ranjit',9000,'hr','manager','2019-07-20')")

In [9]:
result=cur.execute("Select * from employee")
result.fetchall()

[(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20')]

we can also pass values/arguments to an INSERT statement in the execute() method. You can use the question mark(?) as a placeholder for each value. The syntax of the INSERT will be like the following:

cur.execute(""" insert into employee(id,name,salary,department,postion,hiredate) values(?.?.?.?.?.?) """,entities)

entites=(2,'jhon',4000,'IT','Engineer','2018-02-06')

In [10]:
cur.execute("insert into employee values (2,'henna',5000,'hr','manager','2018-08-19')")

# Entities:

In [11]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute("insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)

In [12]:
entities=(3,'ravi',4500,'it','Engineer','2019-06-20')
sql_insert(con,entities)

entities=(4,'chabi',5000,'Hr','Manager','2020-07-20')
sql_insert(con,entities)

entities=(5,'suzen',6000,'it','Engineer','2021-08-21')
sql_insert(con,entities)

In [13]:
result=cur.execute("select * from employee")
result.fetchall()

[(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20'),
 (2, 'henna', 5000.0, 'hr', 'manager', '2018-08-19'),
 (3, 'ravi', 4500.0, 'it', 'Engineer', '2019-06-20'),
 (4, 'chabi', 5000.0, 'Hr', 'Manager', '2020-07-20'),
 (5, 'suzen', 6000.0, 'it', 'Engineer', '2021-08-21')]

# update function

In [14]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=4')
    con.commit()

In [15]:
sql_update(con)

In [16]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20'),
 (2, 'henna', 5000.0, 'hr', 'manager', '2018-08-19'),
 (3, 'ravi', 4500.0, 'it', 'Engineer', '2019-06-20'),
 (4, 'Martin', 5000.0, 'Hr', 'Manager', '2020-07-20'),
 (5, 'suzen', 6000.0, 'it', 'Engineer', '2021-08-21')]

In [17]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'ranjit'), (2, 'henna'), (3, 'ravi'), (4, 'Martin'), (5, 'suzen')]

In [18]:
results=cur.execute("Select * from employee where salary >5000")
for i in result:
    print(i,end=" ")

(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20') (5, 'suzen', 6000.0, 'it', 'Engineer', '2021-08-21')

In [19]:
result1=cur.execute("Select id,name from employee where department in ('hr')")
for i in result1:
    print(i)

(1, 'ranjit')
(2, 'henna')

# minimum function

In [20]:
result=cur.execute("select min(salary)from employee")
for i in result:
    print (i)

(4500.0,)

# count id

In [21]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(5,)]

# distinct count

In [22]:
result=cur.execute("select distinct(department) from employee")
results.fetchall()

[('hr',), ('it',), ('Hr',)]

# count

In [23]:
result=cur.execute("select count(distinct(department)) from employee")
result.fetchall()

[(3,)]

# sum

In [24]:
result=cur.execute("select sum(salary),position from employee group by position")

In [25]:
result.fetchall()

[(10500.0, 'Engineer'), (5000.0, 'Manager'), (14000.0, 'manager')]

In [26]:
result=cur.execute("select sum(salary),department from employee group by department")
result.fetchall()

[(5000.0, 'Hr'), (14000.0, 'hr'), (10500.0, 'it')]

In [27]:
import sqlite3

In [29]:
con=sqlite3.connect("employeedatabase.db")

In [30]:
cur=con.cursor()

In [31]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [32]:
# make querry
sql="select * from employee"

#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20'),
 (2, 'henna', 5000.0, 'hr', 'manager', '2018-08-19'),
 (3, 'ravi', 4500.0, 'it', 'Engineer', '2019-06-20'),
 (4, 'Martin', 5000.0, 'Hr', 'Manager', '2020-07-20'),
 (5, 'suzen', 6000.0, 'it', 'Engineer', '2021-08-21')]

In [33]:
sql=" select id,name position from employee"

respond=sql_query(sql)
respond.fetchall()

[(1, 'ranjit'), (2, 'henna'), (3, 'ravi'), (4, 'Martin'), (5, 'suzen')]

# SQLITE3 EXECUTEMANY(BULK INSERT)

We can use the executemany statement to insert multiple rows at once.

In [34]:
entities=(4,'joseph',4000,'account','CA','2016-12-05'),(5,'Maria',1000,'sales','sales Executive','2019-12-3')

In [35]:
result=cur.execute('select * from employee')

result.fetchall()

[(1, 'ranjit', 9000.0, 'hr', 'manager', '2019-07-20'),
 (2, 'henna', 5000.0, 'hr', 'manager', '2018-08-19'),
 (3, 'ravi', 4500.0, 'it', 'Engineer', '2019-06-20'),
 (4, 'Martin', 5000.0, 'Hr', 'Manager', '2020-07-20'),
 (5, 'suzen', 6000.0, 'it', 'Engineer', '2021-08-21')]

### Another methord to insert many values by def function.

cur.executemany("insert into employee(id,name,salary,department,position,hiredate),values(?,?,?,?,?,?)",entities)

In [38]:
con.close()

# EXERCISE 3.SQLite

### Referential Integrity.

In [40]:
# is required to maintain the data consistancy between two tables.

import sqlite3

In [41]:
db=sqlite3.connect("Student_Database.db")

In [42]:
cur=db.cursor()

In [52]:
cur.execute("create table Course(Course_ID int Primary Key, Course_Name text,Duration int)")

OperationalError: table Course already exists

In [56]:
# Here student table will come foreign key as we are calling this from course take which is primary key over their. 

cur.execute("Create table student(roll_no int primary key,studentname text,age int,course_ID int,foreign key(course_ID) references course(Course_ID))")

OperationalError: table student already exists

In [54]:
cur.execute("insert into course values(78,'Data Science',12),(56,'Python',4),(101,'DataBase',7)")

print(cur.rowcount,'rows')

db.commit()

IntegrityError: UNIQUE constraint failed: Course.Course_ID

In [47]:
cur.execute("insert into student values(1,'Amit',22,78),(2,'Peter',33,56),(10,'Dinesh',27,101),(4,'Andrew',24,78)")

print(cur.rowcount,'rows')

db.commit()

IntegrityError: UNIQUE constraint failed: student.roll_no

In [55]:
cur.execute("insert into student values(4,'Andrew',24,78)")

print(cur.rowcount,'rows')

db.commit()

IntegrityError: UNIQUE constraint failed: student.roll_no

In [57]:
result=cur.execute("Select * from course")
result.fetchall()

[(78, 'Data Science', 12), (56, 'Python', 4), (101, 'DataBase', 7)]

In [58]:
result=cur.execute("Select * from student")
result.fetchall()

[(1, 'Amit', 22, 78),
 (2, 'Peter', 33, 56),
 (10, 'Dinesh', 27, 101),
 (4, 'Andrew', 24, 78)]

In [65]:
# finding id whose id is Data Science.

result=cur.execute("select course_id from course where Course_Name='Data Science'")

In [67]:
for i in result:
    print(i)

(78,)

# SUBquery(query inside query)

In [68]:
# Nested Query
"""
example:
    select* from student where cid=(select course_Id from course where course_Name is "Data Science")

"""

'\nexample:\n    select* from student where cid=(select course_Id from course where course_Name is "Data Science")\n\n'

In [70]:
result=cur.execute("select * from student where course_id=(Select course_ID from course where course_Name is 'Data Science')")

In [71]:
result.fetchall()

[(1, 'Amit', 22, 78), (4, 'Andrew', 24, 78)]

In [72]:
result=cur.execute("Select * from  Student where course_Id=(Select course_Id from course where Course_Name is 'Python')")

In [73]:
result.fetchall()

[(2, 'Peter', 33, 56)]

## JOIN:

In [74]:
"""
innerjoin= common data from both the table will be called
left join= data from left table side
right join= data from right table side

full outer join= All the data from table 
"""

'\ninnerjoin= common data from both the table will be called\nleft join= data from left table side\nright join= data from right table side\n\nfull outer join= All the data from table \n'

### Inner joint

In [79]:
result=cur.execute("Select student.roll_no,student.course_Id,student.studentName,course.course_id,course.course_Name from student INNER JOIN course on student.course_Id = course.course_ID")

In [80]:
for i in result:
    print(i)

(1, 78, 'Amit', 78, 'Data Science')
(2, 56, 'Peter', 56, 'Python')
(10, 101, 'Dinesh', 101, 'DataBase')
(4, 78, 'Andrew', 78, 'Data Science')

In [81]:
result=cur.execute("Select student.roll_no,student.course_Id,student.studentName,course.course_id,course.course_Name from student LEFT JOIN course on student.course_Id = course.course_ID")
for i in result:
    print(i)

(1, 78, 'Amit', 78, 'Data Science')
(2, 56, 'Peter', 56, 'Python')
(10, 101, 'Dinesh', 101, 'DataBase')
(4, 78, 'Andrew', 78, 'Data Science')

In [87]:
result=cur.execute("Select student.roll_no, Course.course_Id, student.studentName, course.course_Name from course RIGHT JOIN course on student.course_Id = course.course_ID")
for i in result:
    print(i)

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported